I'm also seeing this issue. It looks like the following values are always  adjusted
```hcl
  ~ resource "cloudflare_dns_record" "domain-com_CAA_reporting" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + size           = 0
            # (3 unchanged attributes hidden)
        }
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
    }
```
